app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first"], ["content", "Hi! this is my first post! :)"], ["created_at", "2016-11-05 00:09:54.083748"], ["updated_at", "2016-11-05 00:09:54.083748"]]
---
	def create
		@post=Post.new(postparams)

		if @post.save